team1_num = 5
team2_num = 6
score_1 = 40
score_2 = 42
team1_time = 1552.512
team2_time = 2153.31451
tasks_total = 82
time_avg = 45.2
challenge_result = 'победа команды Волшебники данных!'

print('Переменные: количество участников первой команды (team1_num)')
print('Пример итоговой строки: "В команде Мастера кода участников: %s! ' % team1_num)
print()
print('Переменные: количество участников в обеих командах (team1_num, team2_num).')
print('Пример итоговой строки: "Итого сегодня в командах участников: %s и %s!"' % (team1_num, team2_num))
print()
print('Переменные: количество задач решённых командой 2 (score_2).')
print('Пример итоговой строки: "Команда Волшебники данных решила задач: {}!"'.format(score_2))
print()
print('Переменные: количество решённых задач по командам: score_1, score_2')
print(f'Пример итоговой строки: "Команды решили {score_1} и {score_2} задач.”')
print()
print('Переменные: исход соревнования (challenge_result).')
print(f'Пример итоговой строки: "Результат битвы: {challenge_result}!')
print()
print('Переменные: количество задач (tasks_total) и среднее время решения (time_avg).')
print(f'Пример итоговой строки: "Сегодня было решено {tasks_total} задач, в среднем по {time_avg} секунды на задачу!."')
